nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/ecat_examples/digital_io/cm33_core1/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "hal_pinctrl.h"
#include "board.h"

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);
void BOARD_InitEcatMDIOPins(void);
void BOARD_InitEcatI2CPins(void);
void BOARD_InitEcatPortRmiiPins(void);
void BOARD_InitEcatPortMiiPins(void);
void BOARD_InitEcatLinkPins(void);
void BOARD_InitEcatResetPins(void);
void BOARD_InitI2C6Pins(void);                                /*!< Function assigned for the core: undefined[cm33] */
void BOARD_InitGPIOPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
